{-# OPTIONS_GHC -Wno-incomplete-patterns #-}
import Distribution.SPDX.LicenseId (LicenseId(MIT_0))
-- Лабораторна робота №1
-- студентки групи КН-31 підгрупа 1
-- Івахненко Ірини

-- Мета: Набути досвiду визначення рекурсивних функцiй, використання 
-- механiзму зiставлення зi зразком i роботи з кортежами та списками.


-- Варіант 6

-- Завдання 1. Об'єднати два списка, чергуючи їх елементи.

-- а) без застосування
f1a :: [a] -> [a] -> [a]
f1a [] []= []
f1a xs [] = xs
f1a [] ys = ys
f1a (x1:xs) ys = x1 : f1a ys xs

-- б) з застосуванням вбудованих функцiй.
f1b :: [a] -> [a] -> [a]
f1b [] []= []
f1b xs [] = xs
f1b [] ys = ys
f1b xs ys = head xs : f1a ys (tail xs)

-- Завдання 2. Визначити, чи є число простим.

-- а) без застосування
f2a :: Integer -> Bool
f2a 1 = False
f2a 2 = True
f2a n 
    | [x | x <- [2 .. n-1], n `mod` x == 0] /= [] = False
    | otherwise = True

-- б) з застосуванням вбудованих функцiй.
f2b :: Integer -> Bool
f2b 1 = False
f2b 2 = True
f2b n 
    | length[x | x <- [2 .. n-1], n `mod` x == 0] > 0 = False
    | otherwise = True

-- Висновок: в ході лабораторної роботи набули досвiду визначення рекурсивних функцiй, використання 
-- механiзму зiставлення зi зразком i роботи з кортежами та списками.