{-# OPTIONS_GHC -Wno-incomplete-patterns #-}
-- Лабораторна робота №1
-- студентки групи КН-31 підгрупа 1

-- Варіант 6

-- Завдання 1. Наведiть приклади виразiв вказаного типу.
-- 6) [(Integer, (Char,[Bool])]
-- [((123),('a',[True])),(1,('b',[False]))]
-- [(3,('1',[True,False])),(120,('\n',[1==1,1/=1]))]
-- [(29,('g',[True])),(45,('q',[1==1,True]))]

--  Завдання 2. Визначте два варiанти вказаних далi функцiй.
-- Перший варiант – з одним аргументом-кортежем, другий – без використання кортежiв чи спискiв.
-- 6) Функцiя визначає, чи одне коло повнiстю мiститься в iншому. Кожне коло задається координатами центра та радiусом.

f1 :: (Integer, Integer, Integer, Integer)->Bool
f1 (c1,r1,c2,r2) = (c1==c2 && r1==r2) || (c2>=c1 && c2+r2<=c1+r1) || (c2<=c1 && c1-r1<=c2-r2)

f2 :: Integer -> Integer -> Integer -> Integer -> Bool
f2 c1 c2 r1 r2 = (c1==c2 && r1==r2) || (c2>=c1 && c2+r2<=c1+r1) || (c2<=c1 && c1-r1<=c2-r2)

-- Висновок: в ході лабораторної роботи ознайомилися із структурою і функціями GHC. Набули навички роботи з інтерпретатором ghci
-- та навчилися писати найпростіші функції.